truongbaan/NuvoM487Tetris-An-and-Minh/M487/M480_LCD_with_Touch/Tutorial_8_M480_LCD_with_Touch/main.c
    /* EBI AD6, AD7 pins on PD.8, PD.9 */
    SYS->GPD_MFPH &= ~(SYS_GPD_MFPH_PD8MFP_Msk | SYS_GPD_MFPH_PD9MFP_Msk);
    SYS->GPD_MFPH |= (SYS_GPD_MFPH_PD8MFP_EBI_AD6 | SYS_GPD_MFPH_PD9MFP_EBI_AD7);

    /* EBI AD8, AD9 pins on PE.14, PE.15 */
    SYS->GPE_MFPH &= ~(SYS_GPE_MFPH_PE14MFP_Msk | SYS_GPE_MFPH_PE15MFP_Msk);
    SYS->GPE_MFPH |= (SYS_GPE_MFPH_PE14MFP_EBI_AD8 | SYS_GPE_MFPH_PE15MFP_EBI_AD9);

    /* EBI AD10, AD11 pins on PE.1, PE.0 */
    SYS->GPE_MFPL &= ~(SYS_GPE_MFPL_PE1MFP_Msk | SYS_GPE_MFPL_PE0MFP_Msk);
    SYS->GPE_MFPL |= (SYS_GPE_MFPL_PE1MFP_EBI_AD10 | SYS_GPE_MFPL_PE0MFP_EBI_AD11);

    /* EBI AD12~15 pins on PH.8~11 */
    SYS->GPH_MFPH &= ~(SYS_GPH_MFPH_PH8MFP_Msk  | SYS_GPH_MFPH_PH9MFP_Msk |
                       SYS_GPH_MFPH_PH10MFP_Msk | SYS_GPH_MFPH_PH11MFP_Msk);
    SYS->GPH_MFPH |= (SYS_GPH_MFPH_PH8MFP_EBI_AD12  | SYS_GPH_MFPH_PH9MFP_EBI_AD13 |
                      SYS_GPH_MFPH_PH10MFP_EBI_AD14 | SYS_GPH_MFPH_PH11MFP_EBI_AD15);

    /* Configure PH.3 as Output mode for LCD_RS (use GPIO PH.3 to control LCD_RS) */
    GPIO_SetMode(PH, BIT3, GPIO_MODE_OUTPUT);
    PH3 = 1;

    /* EBI RD and WR pins on PE.4 and PE.5 */
    SYS->GPE_MFPL &= ~(SYS_GPE_MFPL_PE4MFP_Msk | SYS_GPE_MFPL_PE5MFP_Msk);
    SYS->GPE_MFPL |= (SYS_GPE_MFPL_PE4MFP_EBI_nWR | SYS_GPE_MFPL_PE5MFP_EBI_nRD);

    /* EBI CS0 pin on PD.14 */
    SYS->GPD_MFPH &= ~SYS_GPD_MFPH_PD14MFP_Msk;
    SYS->GPD_MFPH |= SYS_GPD_MFPH_PD14MFP_EBI_nCS0;

    /* Configure PB.6 and PB.7 as Output mode for LCD_RST and LCD_Backlight */
    GPIO_SetMode(PB, BIT6, GPIO_MODE_OUTPUT);
    GPIO_SetMode(PB, BIT7, GPIO_MODE_OUTPUT);
    PB6 = 1;
    PB7 = 0;

    /*=== UART mult-function pins ===*/
    /* Set PD.2 and PD.3 multi-function pins for UART0 RXD, TXD */
    SYS->GPD_MFPL &= ~(SYS_GPD_MFPL_PD2MFP_Msk | SYS_GPD_MFPL_PD3MFP_Msk);
    SYS->GPD_MFPL |= (SYS_GPD_MFPL_PD2MFP_UART0_RXD | SYS_GPD_MFPL_PD3MFP_UART0_TXD);
		SYS->GPB_MFPH &= ~(0xful << 16) | (0xful << 20);	// Clear current settings PB.12 [19:16], PB.13 [23:20]
		SYS->GPB_MFPH |= (0x06UL << 16) | (0x06UL << 20);	// UART0 - MFP6
		
		SYS_LockReg();
}

/* Timer0 to track game play time */
void Timer0_Init(void)
{
		/* Open Timer0 in periodic mode, enable interrupt and 1 interrupt tick per second */
    TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 1);
    TIMER_EnableInt(TIMER0);
		NVIC_EnableIRQ(TMR0_IRQn);
}

/* Timer1 to control the game speed delay */
void Timer1_Init(void)
{
		/* 12MHz Timer1 Clock Frequency */
		TIMER_Open(TIMER1, TIMER_PERIODIC_MODE, 12000000);
		/* 1/12MHz * 1200000 = 100ms */
		TIMER_SET_CMP_VALUE(TIMER1, LEVEL1_SPEED);
		TIMER_EnableInt(TIMER1);
		NVIC_EnableIRQ(TMR1_IRQn);
}

void TMR0_IRQHandler(void)
{
    if(TIMER_GetIntFlag(TIMER0) == 1)
    {
        /* Clear Timer0 time-out interrupt flag */
        TIMER_ClearIntFlag(TIMER0);

        totalSeconds++;
    }
}

void TMR1_IRQHandler(void)
{
	gameDelayFlag = 1;
	TIMER_ClearIntFlag(TIMER1);
}

void disableSelectiveInterrupts()
{
	NVIC_DisableIRQ(GPA_IRQn);
	NVIC_DisableIRQ(GPC_IRQn);
	NVIC_DisableIRQ(GPG_IRQn);
}

void enableSelectiveInterrupts()
{
	NVIC_EnableIRQ(GPA_IRQn);
	NVIC_EnableIRQ(GPC_IRQn);
	NVIC_EnableIRQ(GPG_IRQn);
}

/**
 * @brief       GPIO PC IRQ
 *
 * @param       None
 *
 * @return      None
 *
 * @details     The PC default IRQ, declared in startup_M480.s.
 */
void GPC_IRQHandler(void)
{
    /* To check if PC.10 interrupt occurred */
    if(GPIO_GET_INT_FLAG(PC, BIT10))
    {
        GPIO_CLR_INT_FLAG(PC, BIT10);
        printf("Joystick (Down) - PC.10 INT occurred.\n");
				keyPressed = 1;
				key = 's';
    }
		else if(GPIO_GET_INT_FLAG(PC, BIT9))
		{
				GPIO_CLR_INT_FLAG(PC, BIT9);
				printf("Joystick (Left) - PC.9 INT occured.\n");
				keyPressed = 1;
				key = 'a';
		}
    else
    {
        /* Un-expected interrupt. Just clear all PC interrupts */
        PC->INTSRC = PC->INTSRC;
        printf("Un-expected interrupts.\n");
    }
}

/**
 * @brief       GPIO PA IRQ
 *
 * @param       None
 *
 * @return      None
 *
 * @details     The PA default IRQ, declared in startup_M480.s.
 */
void GPA_IRQHandler(void)
{
    /* To check if PA.0 interrupt occurred */
    if(GPIO_GET_INT_FLAG(PA, BIT0))
    {
        GPIO_CLR_INT_FLAG(PA, BIT0);
        printf("SW1 - PA.0 INT occurred.\n");
				keyPressed = 1;
				key = 'p';
    }
		else if(GPIO_GET_INT_FLAG(PA, BIT1))
    {
        GPIO_CLR_INT_FLAG(PA, BIT1);
        printf("SW2 - PA.1 INT occurred.\n");
				keyPressed = 1;
				key = 'v';
    }
    else
    {
        /* Un-expected interrupt. Just clear all PC interrupts */
        PA->INTSRC = PA->INTSRC;
        printf("Un-expected interrupts.\n");
    }
}

/**
 * @brief       GPIO PG IRQ
 *
 * @param       None
 *
 * @return      None
 *
 * @details     The PG default IRQ, declared in startup_M480.s.
 */
void GPG_IRQHandler(void)
{
    /* To check if PG.2 interrupt occurred */
    if(GPIO_GET_INT_FLAG(PG, BIT2))
    {
        GPIO_CLR_INT_FLAG(PG, BIT2);
        printf("Joystick (Up) - PG.2 INT occurred.\n");
				keyPressed = 1;
				key = 'w';
    }
		else if(GPIO_GET_INT_FLAG(PG, BIT4))
    {
        GPIO_CLR_INT_FLAG(PG, BIT4);
        printf("Joystick (Right) - PG.4 INT occurred.\n");
				keyPressed = 1;
				key = 'd';
    }
		//else if(GPIO_GET_INT_FLAG(PG, BIT3))
    //{
    //    GPIO_CLR_INT_FLAG(PG, BIT3);
    //    printf("Joystick (Center) - PG.3 INT occurred.\n");
		//		//keyPressed = 1;
    //}
    else
    {
        /* Un-expected interrupt. Just clear all PC interrupts */
        PG->INTSRC = PG->INTSRC;
        printf("Un-expected interrupts.\n");
    }
}

void Default_Handler(void)
{
		uint32_t irq_num = SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk;
    printf("??  Default_Handler: Unhandled IRQ #%lu\n", (unsigned long)(irq_num & 0x1FF));
    while (1);  // Trap unexpected interrupts
}

// func to init the board when first start
void createBoard(uint8_t board[HEIGHT][WIDTH]) {
    for (i = 0; i < HEIGHT; i++) {
        for (j = 0; j < WIDTH; j++) {
            board[i][j] = 0; // 0 == empty cell
        }
    }
}

